In [1]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//ex_rate_usd_eur.csv",header=None) #relative path represented as ..
data3.columns=['Date3','exchange']
print(data3.columns)

Index(['Date3', 'exchange'], dtype='object')

In [2]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

          Date3            exchange
1    1979-01-01  0.7362143856244080
2    1979-02-01  0.7398091292452590
3    1979-03-01  0.7396449704156109
4    1979-04-01  0.7479431563206160
5    1979-05-01  0.7562580352423540
..          ...                 ...
547  2024-07-01  0.9220765217391300
548  2024-08-01  0.9073031818181820
549  2024-09-01  0.9005252380952379
550  2024-10-01  0.9177386956521740
551  2024-11-01  0.9411600000000000

[551 rows x 2 columns]

In [3]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['exchange']=pd.to_numeric(data3['exchange'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

         Date3  exchange
1   1979-01-01  0.736214
2   1979-02-01  0.739809
3   1979-03-01  0.739645
4   1979-04-01  0.747943
5   1979-05-01  0.756258
..         ...       ...
547 2024-07-01  0.922077
548 2024-08-01  0.907303
549 2024-09-01  0.900525
550 2024-10-01  0.917739
551 2024-11-01  0.941160

[551 rows x 2 columns]

In [4]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('ME').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  exchange
0   1979-01-31  0.736214
1   1979-02-28  0.739809
2   1979-03-31  0.739645
3   1979-04-30  0.747943
4   1979-05-31  0.756258
..         ...       ...
546 2024-07-31  0.922077
547 2024-08-31  0.907303
548 2024-09-30  0.900525
549 2024-10-31  0.917739
550 2024-11-30  0.941160

[551 rows x 2 columns]

In [5]:
quarterly3.to_csv("ex_rate_eur.csv", index=False)

In [6]:
quarterly3

         Date3  exchange
0   1979-01-31  0.736214
1   1979-02-28  0.739809
2   1979-03-31  0.739645
3   1979-04-30  0.747943
4   1979-05-31  0.756258
..         ...       ...
546 2024-07-31  0.922077
547 2024-08-31  0.907303
548 2024-09-30  0.900525
549 2024-10-31  0.917739
550 2024-11-30  0.941160

[551 rows x 2 columns]